Simulación/simpleFoam/0/pointDisplacement
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cylinder
    {
        type            fixedValue;
        value           $internalField;
    }
    flapTop
    {
        type            fixedValue;
        value           $internalField;
    }
    flapBottom
    {
        type            fixedValue;
        value           $internalField;
    }
    flapSide
    {
        type            fixedValue;
        value           $internalField;
    }
    
    top
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
        defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
