Simulación/simpleFoam/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/
#includeEtc "caseDicts/postProcessing/forces/forceCoeffsIncompressible.cfg"

writeFile true;
log	true;

patches     (cylinder flapSide flapTop flapBottom);

magUInf    	0.83;
lRef        	0.035;
Aref        	0.0112;
rho		rhoInf;
rhoInf		1.205;

liftDir     (0 1 0);
dragDir     (1 0 0);

CofR        (0.3 0.3 0.08);
pitchAxis   (0 0 1);

// ************************************************************************* //
